# shell tools
cask "iterm2"
brew "tmux"
brew "zsh"
brew "zsh-syntax-highlighting"

# vim tools
brew "nvim"
brew "aspell"
brew "ctags"

# search tools
brew "the_silver_searcher"

# Source Control Tools
brew "hub"
brew "tig"

brew "fnm"
brew "pyenv"
brew "pyenv-virtualenv"
brew "zlib" # needed for pyenv installing
brew "sqlite"

tap "homebrew/cask-fonts"
cask "font-sauce-code-pro-nerd-font"
